#### <font color="#03997A"> Diplomado en Ciencia de datos UNAM </font>
##### <font color="#03997A"> Mto: Getsemani Ruben Castro Villanueva </font>
##### <font color="#03997A"> Modulo 5 Manipulación de datos en Python</font>
##### <font color="#03997A">Practica 4 Alumno: Ibarra Ramírez Sergio  </font>

In [1]:
import pandas as pd

Vamos a leer los datos

In [13]:
archivo1_merge = pd.read_csv("archivo_uno_merge.csv")

archivo2_merge = pd.read_csv("archivo_dos_merge.csv")

archivo1_merge

    Clave  Numero1  Numero2
0       1       51       61
1       2       92      102
2       3       14       24
3       4       71       81
4       5       60       70
5       6       20       30
6       7       82       92
7       8       86       96
8       9       74       84
9      10       74       84
10     11       87       97
11     12       99      109
12     13       23       33
13     14        2       12
14     15       21       31

In [8]:
archivo2_merge.head()

   Clave  Numero3
0      6       52
1      7        1
2      8       87
3      9       29
4     10       37

Ejemplo de joint entre dos data.Frame

In [14]:
archivo_mergeado_inner = pd.merge(archivo1_merge, archivo2_merge, on ='Clave', how='inner')

archivo_mergeado_inner

   Clave  Numero1  Numero2  Numero3
0      6       20       30       52
1      7       82       92        1
2      8       86       96       87
3      9       74       84       29
4     10       74       84       37
5     11       87       97        1
6     12       99      109       63
7     13       23       33       59
8     14        2       12       20
9     15       21       31       32

In [15]:
archivo_mergeado_left = pd.merge(archivo1_merge, archivo2_merge, on ='Clave', how='left')

archivo_mergeado_left

    Clave  Numero1  Numero2  Numero3
0       1       51       61      NaN
1       2       92      102      NaN
2       3       14       24      NaN
3       4       71       81      NaN
4       5       60       70      NaN
5       6       20       30     52.0
6       7       82       92      1.0
7       8       86       96     87.0
8       9       74       84     29.0
9      10       74       84     37.0
10     11       87       97      1.0
11     12       99      109     63.0
12     13       23       33     59.0
13     14        2       12     20.0
14     15       21       31     32.0

##### Exploración y limpieza de datos

In [17]:
titanic_csv = pd.read_csv("titanic.csv")

titanic_csv.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
## ¿Qué tipo de datos tienen las columnas de mi dataFrame? 

titanic_csv.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [19]:
## ¿Qué tipo de datos tiene una columna particular de mi dataFrame? 

titanic_csv['PassengerId'].dtypes

dtype('int64')

Para recorrer todas las columnas

In [20]:
[i for i in titanic_csv.columns]

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

Enteros y flotantes como numéricos

In [21]:
columnas_numericas = [i for i in titanic_csv.columns if titanic_csv[i].dtype!='object' ]
columnas_numericas

['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

Columnas con datos de tipo objetos

In [22]:
columnas_texto = [i for i in titanic_csv.columns if titanic_csv[i].dtype=='object' ]
columnas_texto

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [24]:
titanic_csv[['Cabin', 'Embarked']]

    Cabin Embarked
0     NaN        S
1     C85        C
2     NaN        S
3    C123        S
4     NaN        S
..    ...      ...
886   NaN        S
887   B42        S
888   NaN        S
889  C148        C
890   NaN        Q

[891 rows x 2 columns]

In [28]:
type(titanic_csv[['Cabin', 'Embarked']])

pandas.core.frame.DataFrame

In [27]:
type(titanic_csv['Cabin'])

pandas.core.series.Series

In [30]:
titanic_csv[['Age']]

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [32]:
## Seleccionamos las columnas numericas

titanic_csv[columnas_numericas].head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

In [33]:
titanic_csv[columnas_numericas].describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [34]:
## Uso de método describe() en variables de tipo categorico 

titanic_csv[columnas_texto].describe()

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

Ejemplo de cambio de tipo de dato de un df

In [35]:
titanic_csv['Pclass'].dtype

dtype('int64')

In [36]:
titanic_csv['Pclass'] = titanic_csv['Pclass'].astype(str)
titanic_csv['Pclass'].dtype

dtype('O')

Actualizar nuestras listas de variables portipo de dato

In [41]:
columnas_numericas = [i for i in titanic_csv.columns if titanic_csv[i].dtype!='object' ]


columnas_texto = [i for i in titanic_csv.columns if titanic_csv[i].dtype=='object' ]


titanic_csv[columnas_texto].describe()

       Pclass                     Name   Sex  Ticket    Cabin Embarked
count     891                      891   891     891      204      889
unique      3                      891     2     681      147        3
top         3  Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq      491                        1   577       7        4      644

##### Manipulación de datos ausentes o nulos

In [42]:

titanic_csv[['PassengerId', 'Age']].describe()

       PassengerId         Age
count   891.000000  714.000000
mean    446.000000   29.699118
std     257.353842   14.526497
min       1.000000    0.420000
25%     223.500000   20.125000
50%     446.000000   28.000000
75%     668.500000   38.000000
max     891.000000   80.000000

In [ ]:
## ¿Cuantos valores nulos tiene mi columna?

In [44]:
titanic_csv['Age'].isnull().sum()

177

Para ver el número de nulos en todas las columnas

In [48]:
porcentaje_datos_nulos_por_variable = titanic_csv.isnull().sum() / len(titanic_csv.index)
porcentaje_datos_nulos_por_variable

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [49]:
type(porcentaje_datos_nulos_por_variable)

pandas.core.series.Series

In [51]:
porcentaje_datos_nulos_por_variable.index

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [52]:
porcentaje_datos_nulos_por_variable.values

array([0.        , 0.        , 0.        , 0.        , 0.        ,
       0.1986532 , 0.        , 0.        , 0.        , 0.        ,
       0.77104377, 0.00224467])

In [50]:
### Pasamos nuestra salida de porcentaje_datos_nulos_por_variable  a un tipo de dato frame

df_porcentaje_datos_nulos_por_variable = pd.DataFrame({
    'columna':porcentaje_datos_nulos_por_variable.index,
    'pct_datos_nulos': porcentaje_datos_nulos_por_variable.values
})

df_porcentaje_datos_nulos_por_variable

        columna  pct_datos_nulos
0   PassengerId         0.000000
1      Survived         0.000000
2        Pclass         0.000000
3          Name         0.000000
4           Sex         0.000000
5           Age         0.198653
6         SibSp         0.000000
7         Parch         0.000000
8        Ticket         0.000000
9          Fare         0.000000
10        Cabin         0.771044
11     Embarked         0.002245

Vamos a hacer una función que nos ayude a ver el número de nulos por columna

In [61]:
def conteo_nulos_en_df(df):
    porcentaje_datos_nulos_por_variable_uso_funcion = df.isnull().sum() / len(df.index)
    df_porcentaje_datos_nulos_por_variable_uso_funcion = pd.DataFrame({
     'columna':porcentaje_datos_nulos_por_variable_uso_funcion.index,
     'pct_datos_nulos': porcentaje_datos_nulos_por_variable_uso_funcion.values
    
})
    return df_porcentaje_datos_nulos_por_variable_uso_funcion

In [62]:
conteo_nulos_en_df(titanic_csv)

        columna  pct_datos_nulos
0   PassengerId         0.000000
1      Survived         0.000000
2        Pclass         0.000000
3          Name         0.000000
4           Sex         0.000000
5           Age         0.198653
6         SibSp         0.000000
7         Parch         0.000000
8        Ticket         0.000000
9          Fare         0.000000
10        Cabin         0.771044
11     Embarked         0.002245

¿Qué pasa si tenemos datos de distinto tipo en una columna de nuestro data.Frame?

In [63]:
import pandas as pd
import numpy as np

registros = {
    'Identidicador': [1, 2, 3, 4, 5],
    'Edad': [25, 14, 40, 23, 'sin edad'],
    'Tiene_mascota': ['si','no','no','no',np.nan],
    'lista_':[[4, 5, 6], [7, 8], [9],[2,4,3],[9,0,8]]
}

df = pd.DataFrame(registros)

In [64]:
df.head()

   Identidicador      Edad Tiene_mascota     lista_
0              1        25            si  [4, 5, 6]
1              2        14            no     [7, 8]
2              3        40            no        [9]
3              4        23            no  [2, 4, 3]
4              5  sin edad           NaN  [9, 0, 8]

In [65]:
df.dtypes

Identidicador     int64
Edad             object
Tiene_mascota    object
lista_           object
dtype: object

In [72]:
### Convertir nuetro tipo de dato a entero

df['Edad'] = pd.to_numeric(df['Edad'], errors='coerce')
df['Edad']

0    25.0
1    14.0
2    40.0
3    23.0
4     NaN
Name: Edad, dtype: float64

In [75]:
(25 + 14 + 40 + 23) / 4

25.5

In [81]:
## mean() No toma en cuenta los valores NaN para calcular la media 
df['Edad'].mean()

## Obtenemos el maximo de la variable 
df['Edad'].max()

## Obtenemos el maximo de la variable 
df['Edad'].min()

14.0

In [77]:
df['Edad'].fillna(df['Edad'].mean())

0    25.0
1    14.0
2    40.0
3    23.0
4    25.5
Name: Edad, dtype: float64

In [78]:
df['Edad'] = df['Edad'].fillna(df['Edad'].mean())

df.head()

   Identidicador  Edad Tiene_mascota     lista_
0              1  25.0            si  [4, 5, 6]
1              2  14.0            no     [7, 8]
2              3  40.0            no        [9]
3              4  23.0            no  [2, 4, 3]
4              5  25.5           NaN  [9, 0, 8]

Imputación de los valores categoricos nulos con la MODA

In [84]:
df['Tiene_mascota'].mode()[0]

'no'

In [85]:
df['Tiene_mascota'].fillna(df['Tiene_mascota'].mode()[0])

0    si
1    no
2    no
3    no
4    no
Name: Tiene_mascota, dtype: object

In [86]:
df['Tiene_mascota'] = df['Tiene_mascota'].fillna(df['Tiene_mascota'].mode()[0])

df.head()

   Identidicador  Edad Tiene_mascota     lista_
0              1  25.0            si  [4, 5, 6]
1              2  14.0            no     [7, 8]
2              3  40.0            no        [9]
3              4  23.0            no  [2, 4, 3]
4              5  25.5            no  [9, 0, 8]

##### Filtrado y agrupado de datos

In [92]:
## Filtramos alos registros de la Pclass 

titanic_csv[titanic_csv['Pclass']=='3'].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [96]:
## Filtramos alos registros de la Pclass 3 y que sean male 

titanic_csv[(titanic_csv['Pclass']=='3') & (titanic_csv['Sex']=='male')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [99]:
titanic_csv['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [97]:
## Filtramos por registros nulos 

titanic_csv[titanic_csv['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [102]:
titanic_csv.describe()

       PassengerId    Survived         Age       SibSp       Parch        Fare
count   891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838   29.699118    0.523008    0.381594   32.204208
std     257.353842    0.486592   14.526497    1.102743    0.806057   49.693429
min       1.000000    0.000000    0.420000    0.000000    0.000000    0.000000
25%     223.500000    0.000000   20.125000    0.000000    0.000000    7.910400
50%     446.000000    0.000000   28.000000    0.000000    0.000000   14.454200
75%     668.500000    1.000000   38.000000    1.000000    0.000000   31.000000
max     891.000000    1.000000   80.000000    8.000000    6.000000  512.329200

In [101]:
titanic_csv[titanic_csv['Ticket']== '113572']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

Habrá una manera de saber si existe una distribución de costos por puerto

In [103]:
titanic_csv.groupby('Embarked').agg(avg_fare=('Fare','mean'))

           avg_fare
Embarked
C         59.954144
Q         13.276030
S         27.079812

In [104]:
titanic_csv.groupby('Cabin').agg(avg_fare=('Fare','mean'))

        avg_fare
Cabin
A10    40.125000
A14    52.000000
A16    39.600000
A19    26.000000
A20    56.929200
...          ...
F33    11.333333
F38     7.750000
F4     39.000000
G6     13.581250
T      35.500000

[147 rows x 1 columns]

In [108]:
titanic_csv.groupby('Embarked').agg(avg_fare=('Fare','mean') 
                                     ,num_personas =('PassengerId', 'count'))

           avg_fare  num_personas
Embarked
C         59.954144           168
Q         13.276030            77
S         27.079812           644

Se puede agrupar por dos medidas

In [109]:
titanic_csv.groupby(['Embarked', 'Pclass']).agg(avg_fare=('Fare','mean') 
                                     ,num_personas =('PassengerId', 'count'))

                   avg_fare  num_personas
Embarked Pclass
C        1       104.718529            85
         2        25.358335            17
         3        11.214083            66
Q        1        90.000000             2
         2        12.350000             3
         3        11.183393            72
S        1        70.364862           127
         2        20.327439           164
         3        14.644083           353

In [112]:
titanic_csv.groupby(['Embarked', 'Pclass']).agg(avg_fare=('Fare','mean')
                                       ,min_fare=('Fare','min') 
                                       ,max_fare=('Fare','max') 
                                     ,num_personas =('PassengerId', 'count')).reset_index()

  Embarked Pclass    avg_fare  min_fare  max_fare  num_personas
0        C      1  104.718529   26.5500  512.3292            85
1        C      2   25.358335   12.0000   41.5792            17
2        C      3   11.214083    4.0125   22.3583            66
3        Q      1   90.000000   90.0000   90.0000             2
4        Q      2   12.350000   12.3500   12.3500             3
5        Q      3   11.183393    6.7500   29.1250            72
6        S      1   70.364862    0.0000  263.0000           127
7        S      2   20.327439    0.0000   73.5000           164
8        S      3   14.644083    0.0000   69.5500           353

Nos inclinamos que embarcaron en el puerto S

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Embarked, Length: 891, dtype: bool